The org_id you supplied looks incorrect:

```
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "019970-D6BDB5-6AF850"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "sample-gke-shared-project"
      + number              = (known after apply)
      + org_id              = "\\128653134652"
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }
```

Make sure the `org_id` is *only* the numeric org ID.